	var RootList='آدم‌ آزر ا أبابيل‌ ابب‌ ابد ابراهيم‌ ابريق‌ ابق‌ ابل‌ إبليس‌ ابو ابى‌ اتى‌ اثث‌ اثر اثل‌ اثم‌ اجج‌ اجر اجل‌ احد احزاب‌ احقاف‌ احمد اخذ اخر اخو ادد ادريس‌ ادى‌ اذ اذا اذن‌ اذى‌ ارب‌ ارث‌ ارض‌ ارك‌ ارم‌ ازر ازز ازف‌ اسباط استبرق‌ اسحاق‌ اسر اسرائيل‌ اسس‌ اسف‌ اسلام‌ اسماعيل‌ اسن‌ اسو اسى‌ اشر اصر اصل‌ أعراف‌ افف‌ افق‌ افك‌ افل‌ اقصو اكل‌ الا التى‌ الذان‌ الذى‌ الذين‌ الف‌ الك‌ اللاتى‌ اللائى‌ الل‌ الله‌ الم‌ اله‌ الو الى‌ الياس‌ ال‌ياسين‌ اليسع‌ ام‌ اما أما امت‌ امد امر امس‌ امل‌ امم‌ امن‌ امو ان‌ انا انت‌ انتم‌ انتما انث‌ انجيل‌ انس‌ انف‌ انم‌ انن‌ اننى‌ انى‌ اهل‌ او اوب‌ اود اولاء اول‌ اولى‌ اون‌ اوه‌ اوى‌ اى‌ اياك‌ اياكم‌ ايان‌ ايانا اياه‌ اياهم‌ اياى‌ ايد ايكه‌ ايم‌ اين‌ ايوب‌ ائى‌ ايى‌ ب‌ بابل‌ بتر بتك‌ بتل‌ بثث‌ بجس‌ بحث‌ بحر بخس‌ بخع‌ بخل‌ بدء بدر بدع‌ بدل‌ بدن‌ بدو بذر برء برج‌ برح‌ برد برر برز برزخ‌ برص‌ برق‌ برك‌ برم‌ بره‌ برهن‌ بزغ‌ بسر بسس‌ بسط بسق‌ بسل‌ بسم‌ بشر بصر بصل‌ بضع‌ بطء بطر بطش‌ بطل‌ بطن‌ بعث‌ بعثر بعد بعر بعض‌ بعل‌ بغت‌ بغض‌ بغل‌ بغى‌ بقر بقع‌ بقل‌ بقى‌ بكر بكم‌ بكة بكى‌ بل‌ بلد بلس‌ بلع‌ بلغ‌ بلو بلى‌ بنن‌ بنو بنى‌ بهت‌ بهج‌ بهل‌ بهم‌ بوء بوب‌ بور بول‌ بيت‌ بيد بئر بئس‌ بيض‌ بيع‌ بين‌ ت‌ تابوت‌ تبب‌ تبت‌ تبر تبع‌ تجر تحت‌ ترب‌ ترف‌ ترق‌ ترقوه‌ ترك‌ تسع‌ تعس‌ تفث‌ تقن‌ تلك‌ تلكم‌ تلكما تلل‌ تلو تمم‌ تنور توب‌ تور توراة تين‌ تيه‌ ثبت‌ ثبر ثبط ثبى‌ ثجج‌ ثخن‌ ثرب‌ ثرى‌ ثعب‌ ثقب‌ ثقف‌ ثقل‌ ثلث‌ ثلل‌ ثم‌ ثمر ثمم‌ ثمن‌ ثمود ثنى‌ ثوب‌ ثور ثوى‌ ثيب‌ جالوت‌ جبب‌ جبت‌ جبر جبريل‌ جبل‌ جبن‌ جبه‌ جبى‌ جثث‌ جثم‌ جثو جحد جحم‌ جدث‌ جدد جدر جدل‌ جذذ جذع‌ جذو جرح‌ جرد جرر جرز جرع‌ جرف‌ جرم‌ جرى‌ جزء جزع‌ جزى‌ جسد جسس‌ جسم‌ جعل‌ جف‌ء جفن‌ جفو جلب‌ جلد جلس‌ جلل‌ جلو جمح‌ جمد جمع‌ جمعة جمل‌ جمم‌ جناح‌ جنب‌ جنح‌ جند جنف‌ جنن‌ جنى‌ جهد جهر جهز جهل‌ جهنم‌ جوب‌ جود جودى‌ جور جوز جوس‌ جوع‌ جوف‌ جوو جى‌ء جيب‌ جيد جئر ح‌ حبب‌ حبر حبس‌ حبط حبك‌ حبل‌ حتم‌ حتى‌ حثث‌ حجب‌ حجج‌ حجر حجز حدب‌ حدث‌ حدد حدق‌ حذر حرب‌ حرث‌ حرج‌ حرد حرر حرس‌ حرص‌ حرض‌ حرف‌ حرق‌ حرك‌ حرم‌ حرى‌ حرير حزب‌ حزن‌ حسب‌ حسد حسر حسس‌ حسم‌ حسن‌ حشر حصب‌ حصحص‌ حصد حصر حصل‌ حصن‌ حصى‌ حضر حضض‌ حطب‌ حطط حطم‌ حظر حظظ حفد حفر حفظ حفف‌ حفو حقب‌ حقق‌ حكم‌ حلف‌ حلق‌ حلقم‌ حلل‌ حلم‌ حلى‌ حم‌ء حمد حمر حمل‌ حمم‌ حمى‌ حنث‌ حنجر حنذ حنف‌ حنك‌ حنن‌ حنين‌ حواريون‌ حوب‌ حوت‌ حوج‌ حوذ حور حوش‌ حوط حول‌ حوى‌ حيث‌ حيد حير حيز حيص‌ حيض‌ حيف‌ حيق‌ حين‌ حيى‌ خب‌ء خبت‌ خبث‌ خبر خبز خبط خبل‌ خبو ختر ختم‌ خدد خدع‌ خدن‌ خذل‌ خرب‌ خرج‌ خردل‌ خرر خرص‌ خرطم‌ خرق‌ خزن‌ خزى‌ خس‌ء خسر خسف‌ خشب‌ خشع‌ خشى‌ خصص‌ خصف‌ خصم‌ خضد خضر خضع‌ خطء خطب‌ خطط خطف‌ خطو خفت‌ خفض‌ خفف‌ خفى‌ خلد خلص‌ خلط خلع‌ خلف‌ خلق‌ خلل‌ خلو خمد خمر خمس‌ خمص‌ خمط خنزر خنس‌ خنق‌ خور خوض‌ خوف‌ خول‌ خون‌ خوى‌ خيب‌ خير خيط خيل‌ خيم‌ داود دبب‌ دبر دثر دحر دحض‌ دحو دحى‌ دخر دخل‌ دخن‌ درء درج‌ درر درس‌ درك‌ درهم‌ درى‌ دسر دسس‌ دسو دعع‌ دعو دف‌ء دفع‌ دفق‌ دكك‌ دلك‌ دلل‌ دلو دمدم‌ دمر دمع‌ دمغ‌ دمم‌ دمو دمى‌ دنر دنو دهر دهق‌ دهم‌ دهن‌ دهى‌ دور دول‌ دوم‌ دون‌ دئب‌ دين‌ ذا ذات ذانك‌ ذبب‌ ذبح‌ ذبذب‌ ذخر ذرء ذرر ذرع‌ ذرو ذعن‌ ذقن‌ ذكر ذكو ذلك‌ ذلكم‌ ذلكما ذلكن‌ ذلل‌ ذمم‌ ذنب‌ ذهب‌ ذهل‌ ذو ذوا ذود ذوق‌ ذوى‌ ذى‌ ذئب‌ ذيع‌ ذئم‌ ر رب‌ ربب‌ ربح‌ ربص‌ ربط ربع‌ ربو رتع‌ رتق‌ رتل‌ رجج‌ رجز رجس‌ رجع‌ رجف‌ رجل‌ رجم‌ رجو رحب‌ رحق‌ رحل‌ رحم‌ رحمان‌ رخو ردء ردد ردف‌ ردم‌ ردى‌ رذل‌ رزق‌ رس‌ رسخ‌ رسل‌ رسو رشد رصد رصص‌ رضع‌ رضو رطب‌ رعب‌ رعد رعى‌ رغب‌ رغد رغم‌ رفت‌ رفث‌ رفد رفرف‌ رفع‌ رفق‌ رقب‌ رقد رقق‌ رقم‌ رقى‌ ركب‌ ركد ركز ركس‌ ركض‌ ركع‌ ركم‌ ركن‌ رمح‌ رمد رمز رمضان‌ رمم‌ رمن‌ رمى‌ رهب‌ رهط رهق‌ رهن‌ رهو روح‌ رود روض‌ روع‌ روغ‌ روم‌ رويد ريب‌ رئس‌ ريش‌ ريع‌ رئف‌ رين‌ رئى‌ زبد زبر زبن‌ زبور زجج‌ زجر زجو زحزح‌ زحف‌ زخرف‌ زربيه‌ زرع‌ زرق‌ زرى‌ زعم‌ زفر زفف‌ زقم‌ زكريا زكو زلزل‌ زلف‌ زلق‌ زلل‌ زلم‌ زمر زمل‌ زمهر زنجبيل‌ زنم‌ زنى‌ زهد زهر زهق‌ زوج‌ زود زور زول‌ زيت‌ زيتون‌ زيد زيغ‌ زيل‌ زين‌ س‌ سال‌ سامرى‌ سبإ سبب‌ سبت‌ سبح‌ سبط سبع‌ سبغ‌ سبق‌ سبل‌ ستت‌ ستر سجد سجر سجل‌ سجن‌ سجو سجيل‌ سحب‌ سحت‌ سحر سحق‌ سحل‌ سخر سخط سدد سدر سدس‌ سدى‌ سراب‌ سرادق‌ سرب‌ سربال‌ سرج‌ سرح‌ سرد سرر سرع‌ سرف‌ سرق‌ سرمد سرى‌ سطح‌ سطر سطو سعد سعر سعى‌ سغب‌ سفح‌ سفر سفع‌ سفك‌ سفل‌ سفن‌ سفه‌ سقر سقط سقف‌ سقم‌ سقى‌ سكب‌ سكت‌ سكر سكن‌ سلب‌ سلح‌ سلخ‌ سلسبيل‌ سلسل‌ سلط سلف‌ سلق‌ سلك‌ سلل‌ سلم‌ سلو سليمان‌ سمد سمر سمع‌ سمك‌ سمم‌ سمن‌ سمو سنبل‌ سند سندس‌ سنم‌ سنن‌ سنه‌ سنو سهر سهل‌ سهم‌ سهو سواع‌ سوء سوح‌ سود سور سوط سوع‌ سوغ‌ سوف‌ سوق‌ سوم‌ سوى‌ سيب‌ سيح‌ سير سئل‌ سيل‌ سئم‌ سيناء سينين‌ شبه‌ شتت‌ شتو شجر شحح‌ شحم‌ شحن‌ شخص‌ شدد شرب‌ شرح‌ شرد شرذم‌ شرر شرط شرع‌ شرق‌ شرك‌ شرى‌ شطء شطر شطط شطن‌ شعب‌ شعر شعرى‌ شعل‌ شعيب‌ شغف‌ شغل‌ شفع‌ شفق‌ شفه‌ شفو شفى‌ شقق‌ شقو شقى‌ شكر شكس‌ شكك‌ شكل‌ شكو شمت‌ شمخ‌ شمس‌ شمل‌ شمئز شن‌ء شهب‌ شهد شهر شهق‌ شهو شوب‌ شور شوظ شوك‌ شوى‌ شى‌ء شيب‌ شيخ‌ شيد شيع‌ شئم‌ شئن‌ ص‌ صابئون‌ صالح‌ صبب‌ صبح‌ صبر صبع‌ صبغ‌ صبو صحب‌ صحف‌ صخخ‌ صخر صدد صدر صدع‌ صدف‌ صدق‌ صدى‌ صرح‌ صرخ‌ صرر صرصر صرط صرع‌ صرف‌ صرم‌ صعد صعر صعق‌ صغر صغو صفا صفح‌ صفد صفر صفصف‌ صفف‌ صفن‌ صفو صكك‌ صلب‌ صلح‌ صلد صلصل‌ صلو صلى‌ صمت‌ صمد صمع‌ صمم‌ صنع‌ صنم‌ صنو صهر صوب‌ صوت‌ صور صوع‌ صوف‌ صوم‌ صيح‌ صيد صير صيص‌ صيف‌ ضبح‌ ضجع‌ ضحك‌ ضحو ضحى‌ ضدد ضرب‌ ضرر ضرع‌ ضعف‌ ضغث‌ ضغن‌ ضفدع‌ ضلل‌ ضمر ضمم‌ ضنك‌ ضنن‌ ضه‌ء ضوء ضير ضيز ضيع‌ ضيف‌ ضيق‌ ضئن‌ ط طاغوت‌ طالوت‌ طبع‌ طبق‌ طحو طحى‌ طرح‌ طرد طرف‌ طرق‌ طرو طعم‌ طعن‌ طغو طغى‌ طف‌ء طفف‌ طفق‌ طفل‌ طلب‌ طلح‌ طلع‌ طلق‌ طلل‌ طمث‌ طمس‌ طمع‌ طمم‌ طمن‌ طمئن‌ طهر طود طور طوع‌ طوف‌ طوفان‌ طوق‌ طول‌ طوى‌ طيب‌ طير طين‌ ظعن‌ ظفر ظلل‌ ظلم‌ ظما ظم‌ء ظنن‌ ظهر ع‌ عاد عب‌ء عبث‌ عبد عبر عبس‌ عبقر عتب‌ عتد عتق‌ عتل‌ عتو عثر عثو عجب‌ عجز عجف‌ عجل‌ عجم‌ عدد عدس‌ عدل‌ عدن‌ عدو عذب‌ عذر عرب‌ عرج‌ عرجن‌ عرجون‌ عرر عرش‌ عرض‌ عرف‌ عرفات‌ عرم‌ عرو عرى‌ عزب‌ عزر عزز عزل‌ عزم‌ عزو عزى‌ عزير عسر عسعس‌ عسل‌ عسى‌ عشر عشو عصب‌ عصر عصف‌ عصم‌ عصو عصى‌ عضد عضض‌ عضل‌ عضو عطف‌ عطل‌ عطو عظم‌ عفر عفف‌ عفو عقب‌ عقد عقر عقل‌ عقم‌ عكف‌ علق‌ علم‌ علن‌ علو على‌ عمد عمر عمران‌ عمق‌ عمل‌ عمم‌ عمه‌ عمى‌ عن‌ عنب‌ عنت‌ عند عنق‌ عنكب‌ عنكبوت‌ عنو عنى‌ عهد عهن‌ عوج‌ عود عوذ عور عوق‌ عول‌ عوم‌ عون‌ عيب‌ عير عيسى‌ عيش‌ عيل‌ عين‌ عيى‌ غبر غبن‌ غثو غدر غدق‌ غدو غرب‌ غرر غرف‌ غرق‌ غرم‌ غرو غزل‌ غزو غسق‌ غسل‌ غشو غشى‌ غصب‌ غصص‌ غضب‌ غضض‌ غطش‌ غطو غفر غفل‌ غلب‌ غلظ غلف‌ غلق‌ غلل‌ غلم‌ غلو غلى‌ غمر غمز غمض‌ غمم‌ غنم‌ غنى‌ غوث‌ غور غوص‌ غوط غول‌ غوى‌ غيب‌ غيث‌ غير غيض‌ غيظ ف‌ فت‌ء فتح‌ فتر فتق‌ فتل‌ فتن‌ فتو فتى‌ فجج‌ فجر فجو فحش‌ فخر فدى‌ فرت‌ فرث‌ فرج‌ فرح‌ فرد فردوس‌ فرر فرش‌ فرض‌ فرط فرع‌ فرعون‌ فرغ‌ فرق‌ فره‌ فرى‌ فزز فزع‌ فسح‌ فسد فسر فسق‌ فشل‌ فصح‌ فصل‌ فصم‌ فضح‌ فضض‌ فضل‌ فضو فطر فظظ فعل‌ فقد فقر فقع‌ فقه‌ فكر فكك‌ فكه‌ فلح‌ فلق‌ فلك‌ فلن‌ فند فنن‌ فنى‌ فهم‌ فوت‌ فوج‌ فور فوز فوض‌ فوق‌ فوم‌ فوه‌ فى‌ فى‌ء فئد فيض‌ فيل‌ فئى‌ ق‌ قارون‌ قبح‌ قبر قبس‌ قبض‌ قبل‌ قتر قتل‌ قث‌ء قحم‌ قد قدح‌ قدد قدر قدس‌ قدم‌ قدو قذف‌ قرآن‌ قرء قرب‌ قرح‌ قرد قرر قرض‌ قرطس‌ قرع‌ قرف‌ قرن‌ قرنين‌ قرى‌ قريش‌ قسر قسط قسطس‌ قسم‌ قسو قسور قسيسين‌ قشعر قصد قصر قصص‌ قصف‌ قصم‌ قصو قضب‌ قضض‌ قضى‌ قطر قطط قطع‌ قطف‌ قطمر قعد قعر قفل‌ قفو قلب‌ قلد قلع‌ قلل‌ قلم‌ قلى‌ قمح‌ قمر قمص‌ قمطر قمع‌ قمل‌ قنت‌ قنط قنطر قنع‌ قنو قنى‌ قهر قوب‌ قوت‌ قوس‌ قوع‌ قول‌ قوم‌ قوى‌ قيض‌ قيل‌ ك‌ كافور كان‌ كاين‌ كبب‌ كبت‌ كبد كبر كبكب‌ كتب‌ كتم‌ كثب‌ كثر كدح‌ كدر كدى‌ كذب‌ كرب‌ كرر كرس‌ كرم‌ كره‌ كسب‌ كسد كسف‌ كسل‌ كسو كشط كشف‌ كظم‌ كعب‌ كعبة كفت‌ كفر كفف‌ كفل‌ كفو كفى‌ كلا كل‌ء كلب‌ كلتا كلح‌ كلف‌ كلل‌ كلم‌ كلو كم‌ كما كمل‌ كمم‌ كمه‌ كن‌ كند كنز كنس‌ كنن‌ كهف‌ كهل‌ كهن‌ كوب‌ كود كور كوكب‌ كون‌ كوى‌ كى‌ كيد كئس‌ كيف‌ كيل‌ كين‌ لا لات‌ ل‌ لبب‌ لبث‌ لبد لبس‌ لبن‌ لج‌ء لجج‌ لحد لحف‌ لحق‌ لحم‌ لحن‌ لحى‌ لدد لدن‌ لدى‌ لذذ لزب‌ لزم‌ لسن‌ لطف‌ لظى‌ لعب‌ لعل‌ لعن‌ لغب‌ لغو لفت‌ لفح‌ لفظ لفف‌ لفو لقب‌ لقح‌ لقط لقف‌ لقم‌ لقمان‌ لقى‌ لكن‌ لم‌ لما لمح‌ لمز لمس‌ لمم‌ لن‌ لهب‌ لهث‌ لهم‌ لهو لو لوت‌ لوح‌ لوذ لوط لولا لولو لوم‌ لون‌ لوى‌ ليت‌ ليس‌ لئك‌ ليل‌ لين‌ م‌ ما ماجوج‌ ماروت‌ مالك‌ متع‌ متن متى‌ مثل‌ مجد مجوس‌ محص‌ محق‌ محل‌ محمد محن‌ محو مخر مخض‌ مدد مدن‌ مدين‌ مدينه‌ مرء مرج‌ مرح‌ مرد مرر مرض‌ مروه‌ مرى‌ مريم‌ مزج‌ مزق‌ مزن‌ مسح‌ مسخ‌ مسد مسس‌ مسك‌ مسو مسيح‌ مشج‌ مشعر مشى‌ مصر مضغ‌ مضى‌ مطر مطو مع‌ معز معن‌ معى‌ مقت‌ مكث‌ مكر مكن‌ مكة مكو مل‌ء ملح‌ ملق‌ ملك‌ ملل‌ ملو من‌ مناة منع‌ منن‌ منى‌ مهد مهل‌ مهما مهن‌ موت‌ مؤتفكة موج‌ مور موسى‌ مول‌ موه‌ ميد مير ميز ميكال‌ ميل‌ مئى‌ ن‌ نا نب‌ء نبت‌ نبذ نبز نبط نبع‌ نبو نتق‌ نثر نجد نجس‌ نجم‌ نجو نحب‌ نحت‌ نحر نحس‌ نحل‌ نحن‌ نخر نخل‌ ندد ندم‌ ندو ندى‌ نذر نزع‌ نزغ‌ نزف‌ نزل‌ نس‌ء نسب‌ نسخ‌ نسر نسف‌ نسك‌ نسل‌ نسو نسى‌ نش‌ء نشر نشز نشط نصارى‌ نصب‌ نصت‌ نصح‌ نصر نصرانى‌ نصف‌ نصو نصى‌ نضج‌ نضخ‌ نضد نضر نطح‌ نطف‌ نطق‌ نظر نعج‌ نعس‌ نعق‌ نعل‌ نعم‌ نغض‌ نفث‌ نفح‌ نفخ‌ نفد نفذ نفر نفس‌ نفش‌ نفع‌ نفق‌ نفل‌ نفى‌ نقب‌ نقذ نقر نقص‌ نقض‌ نقع‌ نقم‌ نكب‌ نكث‌ نكح‌ نكد نكر نكس‌ نكص‌ نكف‌ نكل‌ نمرق‌ نمل‌ نمم‌ نن‌ نهج‌ نهر نهى‌ نوء نوب‌ نوح‌ نور نوش‌ نوص‌ نوق‌ نوم‌ نون‌ نوى‌ نيل‌ نئى‌ ه‌ ها هاء هات‌ هاتوا هاتين‌ هاروت‌ هارون‌ هامان‌ هاؤم‌ هبط هبو هتى‌ هجد هجر هجع‌ هدد هدم‌ هدهد هدى‌ هذا هذان‌ هذه‌ هرب‌ هرع‌ هزء هزز هزل‌ هزم‌ هشش‌ هشم‌ هضم‌ هطع‌ هكذا هل‌ هلع‌ هلك‌ هلل‌ هلم‌ هم‌ هما همد همر همز همس‌ همم‌ همن‌ هن‌ هنا هنالك‌ هن‌ء هو هود هور هؤلاء هون‌ هوى‌ هى‌ هى‌ء هيت‌ هيج‌ هيل‌ هيم‌ هيهات‌ و وبر وبق‌ وبل‌ وتد وتر وتن‌ وثق‌ وثن‌ وجب‌ وجد وجس‌ وجف‌ وجل‌ وجه‌ وحد وحش‌ وحى‌ ودد ودع‌ ودق‌ ودى‌ وذر ورث‌ ورد ورق‌ ورى‌ وزر وزع‌ وزن‌ وسط وسع‌ وسق‌ وسل‌ وسم‌ وسن‌ وسوس‌ وشى‌ وصب‌ وصد وصف‌ وصل‌ وصى‌ وضع‌ وضن‌ وطء وطر وطن‌ وعد وعظ وعلن‌ وعى‌ وفد وفر وفض‌ وفق‌ وفى‌ وقب‌ وقت‌ وقد وقذ وقر وقع‌ وقف‌ وقى‌ وك‌ء وكد وكز وكل‌ ولج‌ ولد وله‌ ولى‌ ونى‌ وهب‌ وهج‌ وهن‌ وهى‌ وى‌ وئد وئل‌ ويل‌ ى‌ يا ياجوج‌ ياقوت‌ يبس‌ يتم‌ يثرب‌ يحيى‌ يدى‌ يسر يعقوب‌ يعوق‌ يغوث‌ يقطن‌ يقطين‌ يقظ يقن‌ يمم‌ يمن‌ ينع‌ يهود يوسف‌ يوم‌ يونس‌ يى‌ يئس‌ ';
	
	var UChars={HAMZA:'\u0621',ALEF_WITH_MADDA_ABOVE:'\u0622',ALEF_WITH_HAMZA_ABOVE:'\u0623',WAW_WITH_HAMZA_ABOVE:'\u0624',ALEF_WITH_HAMZA_BELOW:'\u0625',YEH_WITH_HAMZA:'\u0626',ALEF:'\u0627',BEH:'\u0628',MARBUTA:'\u0629',TEH:'\u062A',THEH:'\u062B',JEMM:'\u062C',HAH:'\u062D',KHAH:'\u062E',DAL:'\u062F',THAL:'\u0630',REH:'\u0631',ZAIN:'\u0632',SEEN:'\u0633',SHEEN:'\u0634',SAD:'\u0635',DAD:'\u0636',TAH:'\u0637',ZAH:'\u0638',AIN:'\u0639',GHAIN:'\u063A',TATWEEL:'\u0640',FEH:'\u0641',QAF:'\u0642',KAF:'\u0643',LAM:'\u0644',MEEM:'\u0645',NOON:'\u0646',HEH:'\u0647',WAW:'\u0648',ALEF_MAKSURA:'\u0649',YEH:'\u064A',FATHATAN:'\u064B',DAMMATAN:'\u064C',KASRATAN:'\u064D',FATHA:'\u064E',DAMMA:'\u064F',KASRA:'\u0650',SHADDA:'\u0651',SUKUN:'\u0652',MADDA:'\u0653',HAMZA_ABOVE:'\u0654',HAMZA_BELOW:'\u0655',SMALL_ALEF:'\u065F',SUPERSCRIPT_ALEF:'\u0670',ALEF_WASLA:'\u0671',HIGH_SALA:'\u06D6',HIGH_GHALA:'\u06D7',HIGH_MEEM_INITIAL_FORM:'\u06D8',HIGH_LA:'\u06D9',HIGH_JEMM:'\u06DA',HIGH_THREE_DOT:'\u06DB',HIGH_SEEN:'\u06DC',RUB_EL_HIZB:'\u06DE',HIGH_ROUNDED_ZERO:'\u06DF',HIGH_UPRIGHT_ZERO:'\u06E0',HIGH_MEEM:'\u06E2',LOW_SEEN:'\u06E3',SMALL_WAW:'\u06E5',SMALL_YEH:'\u06E6',HIGH_NOON:'\u06E8',SAJDAH:'\u06E9',LOW_STOP:'\u06EA',HIGH_STOP:'\u06EB',HIGH_STOP_FILLED:'\u06EC',LOW_MEEM:'\u06ED',HAMZA_ABOVE_ALEF:'\u0675',DOTLESS_BEH:'\u066E',HIGH_YEH:'\u06E7',ZWNJ:'\u200C',NBSP:'\u00A0',NNBSP:'\u202F',FARSI_YEH:'\u06CC',FARSI_KEHEH:'\u06A9',SWASH_KAF:'\u06AA',YEH_BARREE:'\u06D2'}
	var Roots=[];
	function initRootList(){
		Roots=[];
		var root=RootList.split(' ');
		for(var i=0;i<root.length;i++)
			Roots.push(root[i]);
	}
	var arabic = 'ﺍ ﺏ ﺕ ﺙ ﺝ ﺡ ﺥ ﺩ ﺫ ﺭ ﺯ ﺱ ﺵ ﺹ ﺽ ﻁ ﻅ ﻉ ﻍ ﻑ ﻕ ﻙ ﻝ ﻡ ﻥ هـ ﻭ ﻱ';
	var buck = 'A b t v j H x d * r z s $ S D T Z E g f q k l m n h w y';
	var chars='آ ا ب ت ث ج ح خ د ذ ر ز س ش ص ض ط ظ ع غ ف ق ك ل م ن ه و ي';

	function initCharList(chr){
		rootChar=chr;
		var chars='آ ا ب ت ث ج ح خ د ذ ر ز س ش ص ض ط ظ ع غ ف ق ك ل م ن ه و ي';
		chars=chars.split(' ');
		var str='';
		for(var i=0;i<chars.length;i++){
			var clas=(chars[i]==chr)?'current-char':'';
			str+='<a class="'+clas+'" href="javascript:initRootMenu(\''+chars[i]+'\')">'+chars[i]+'</a> ';
		}
		$('#charList').html(str);
	}
	function initRootMenu(chr){
		initCharList(chr);
		if(!Roots || Roots.length <= 0)
			initRootList();
		var items=[];
		if(chr=='ا')chr='[اإأ]';
		if(chr=='ك')chr='[كک]';
		reg=new RegExp('^'+chr,'');
		for(var i=0;i<Roots.length;i++)
			if(reg.test(Roots[i]))
				items.push({value:Roots[i],text:Roots[i]});
		initMenu('rootMenu',items);
		autocomplete(items);
	}
	function startRootSearch(){
		var root=$('#rootMenu').val();
		$('#pageOffset').val(1);
		$('#searchPattern').html(root);
		searchPattern='Root '+root;
		highlightPattern=searchPattern.replace(/[+!]/g,'|');
		searchResults=null;
///		updateSearchPage();
	}

	function initMenu(menu,items,defVal){
		if(typeof menu=='string')
			menu=$('#'+menu);
			var html='';
			for(var i=0;i<items.length;i++)
				html+='<option value="'+items[i].value+'">'+items[i].text+'</option>';
			menu.html(html).val(defVal);
	}
	
	function initMenu1(menuID,items,defVal){
		var menu=$('#'+menuID)[0];
		var newMenu=document.createElement('select');
		var attr=['id','className','class','onchange'];
		for(var i in attr){
			newMenu[attr[i]]=menu[attr[i]];
			newMenu.setAttribute(attr[i],menu.getAttribute(attr[i]));
		}
		for(var i=0;i<items.length;i++){
			var text=items[i].text;
			var option=document.createElement('option');
			option.text=option.innerHTML=text;
			option.value=items[i].value;
			newMenu.appendChild(option);
			if(defVal&&defVal==items[i].value)
				newMenu.selectedIndex=i;
		}
		menu.parentNode.replaceChild(newMenu,menu);
	}

	var _roots, _str, charsArr, buckArr, _strArr;
	var chars='آ ا ب ت ث ج ح خ د ذ ر ز س ش ص ض ط ظ ع غ ف ق ك ل م ن ه و ي';
	var buck = 'A A b t v j H x d * r z s $ S D T Z E g f q k l m n h w y';
	var buckArr, charsArr;
	var ext = new Array();
	var map = { };
	
	$(document).ready(function(){
		initRootList();	
		_roots= Roots; //'آدم‌ آزر ا أبابيل‌ ابب‌ ابد ابراهيم‌ ابريق‌ ابق‌ ابل‌ إبليس‌ ابو ابى‌ اتى‌ اثث';
	//var arabic = 'ﺍ ﺏ ﺕ ﺙ ﺝ ﺡ ﺥ ﺩ ﺫ ﺭ ﺯ ﺱ ﺵ ﺹ ﺽ ﻁ ﻅ ﻉ ﻍ ﻑ ﻕ ﻙ ﻝ ﻡ ﻥ هـ ﻭ ﻱ';
		charsArr = chars.split(' ');
		buckArr  = buck.split(' ');
		
		//mISSING CHARACTERS:
		// أ إ ئ ء ة ؤ
		charsArr.push( 'ى' ); buckArr.push( 'Y' );
		charsArr.push( 'أ' ); buckArr.push( '>' );
		charsArr.push( 'إ' ); buckArr.push( '<' );
		//charsArr.push( ' ' ); buckArr.push( ' ' );
		//charsArr.push( '' ); buckArr.push( '' );
		charsArr.push( 'ئ' ); buckArr.push( '}' );
		charsArr.push( 'ء' ); buckArr.push( 'X' ); //buckArr.push( '\'' );
		charsArr.push( 'ة' ); buckArr.push( 'P' );
		charsArr.push( 'ؤ' ); buckArr.push( '&' );
		
		
		_str = RootList;
		_strArr = _str.split('');
		for(k=0;k<_strArr.length;++k){found = false;
			for(n=0; n<charsArr.length; ++n){
				if(_strArr[k] == charsArr[n]){//debugger;
					_strArr[k] = buckArr[n]; found = true;			
				}
			}
			if(!found){
				if(!map[ _strArr[k] ]){
					ext.push( _strArr[k] );
					map[ _strArr[k] ] = 1;
				}
				_strArr[k] = ' ';
			}
		}
		_str = _strArr.join('');
		autocomplete(_str);
		///buckArr = _str.split(' ');
		//window.status = _str;
		
//debugger;
		$('#keywords').html( _str ); //'<a href=' + ext.join('</a><a href=index.html#search?>') + '</a>' );
//		$('body').html(  $('body').html() + '<br><div class=arr>[' + ext.join('&nbsp;') + ']</div><br>' + '<br><br>'+ _str);

		
		var cities = ['Paris', 'New York', 'Milan', 'Stockholm', 'Melbourne', 'Montreal', 'Mexico', 'Los Angeles', 'San Francisco', 'London', 'Dubai', 'Madrid', 'Tokyo', 'Hong Kong', 'Sydney'];
		$('#location').autocomplete(cities, 
			{
				autoFill: true,
				selectFirst: true,
				width: '240px'
			});

		$('#YYYsearch').autocomplete( _str,
			{
				autoFill: true,
				selectFirst: true,
				width: '240px'
			});
	});

	
	function EnToAr(word){
		if(!word) return null;
		var ar = '', l, letter, found=false;
		try{
			var wordArr = word.split(''); //split into letters.	//lookup from english to arabic letter. and return it.
			for(l=0; l<wordArr.length; ++l){
				letter = wordArr[l]; found = false;
				for(n=1; n<buckArr.length; ++n){
					if(letter == buckArr[n]){
						ar += charsArr[n]; found=true;
						break;
					}
				}
				if(!found)  ar += letter;
			}
			if( $('#arkeyword') ){
				$('#arkeyword').html( ar ); $('#arkeyword').attr('style', 'width: 550px;');
			}
		}catch(ex){
			debugger;
			ar = '-err: ' + ex + ex.message + ex.lineno;
		}
		return ar;
	}
	
	function autocomplete(items){
		//for(var i=0;i<items.length;i++)
//		var xyz = 'Ams Aml Amm Amn Amw An AnA Ant Antm AntmA Anv Anjyl Ans Anf Anm Ann AnnY AnY Ahl Aw Awb Awd';
		var yyy;
		yyy = items.split(' ').join('\', \'');
		yyy = '[ \'' + yyy + '\' ]';
//		var yyy = [ 'Ams', 'Aml', 'Amm', 'Amn', 'Amw', 'An' ];
		window.status = yyy;
		//debugger;
		yyy = eval(yyy);
		//yyy = new Array( yyy );
		{
			$('#search').autocomplete( yyy,
			{
				autoFill: true,
				selectFirst: true,
				width: '240px',
				multiple: true,
				multipleSeparator: "; ",
				cacheLength: 20,
				formatItem: function(row) { 
					EnToAr(row[0]);
					return row[0];// +' - '+ EnToAr(row[0]);
				},
				//formatMatch: function(row, a, b, c, d){
				//	return row[0]; //true; //row[0]; //EnToAr(row[0]);
				//},
				unautocomplete: function(a, b, c, d){
					debugger;
				}
			})
			.result(function(event, selection){
				window.status = (selection);
				EnToAr(selection[0]);
			})
			.search(function(event, selection){
				//window.status = (selection);
				//EnToAr(selection[0]);
				//debugger;
			});
		}
	}